#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.snowflake_resources.snowflake_database.tf_demo will be created
  + resource "snowflake_database" "tf_demo" {
      + data_retention_time_in_days = 10
      + id                          = (known after apply)
      + is_transient                = false
      + name                        = "TF_DEMO"
    }

  # module.snowflake_resources.snowflake_database_grant.database_ro_grant will be created
  + resource "snowflake_database_grant" "database_ro_grant" {
      + database_name          = "TF_DEMO"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + privilege              = "USAGE"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_database_role.db_role will be created
  + resource "snowflake_database_role" "db_role" {
      + comment  = "my db role"
      + database = "TF_DEMO"
      + id       = (known after apply)
      + name     = "TF_DEMO_READER"
    }

  # module.snowflake_resources.snowflake_schema.tf_schema will be created
  + resource "snowflake_schema" "tf_schema" {
      + data_retention_days = 1
      + database            = "TF_DEMO"
      + id                  = (known after apply)
      + is_managed          = false
      + is_transient        = false
      + name                = "TF_DEMO"
    }

  # module.snowflake_resources.snowflake_schema_grant.schema_ro_grant will be created
  + resource "snowflake_schema_grant" "schema_ro_grant" {
      + database_name          = "TF_DEMO"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "USAGE"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_table_grant.table_ro_grant will be created
  + resource "snowflake_table_grant" "table_ro_grant" {
      + database_name          = "TF_DEMO"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "SELECT"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_view_grant.view_ro_grant will be created
  + resource "snowflake_view_grant" "view_ro_grant" {
      + database_name          = "TF_DEMO"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "SELECT"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_warehouse.task_warehouse will be created
  + resource "snowflake_warehouse" "task_warehouse" {
      + auto_resume                         = true
      + auto_suspend                        = 1
      + enable_query_acceleration           = false
      + id                                  = (known after apply)
      + max_cluster_count                   = (known after apply)
      + max_concurrency_level               = 8
      + min_cluster_count                   = (known after apply)
      + name                                = "DEMO_TASK_WAREHOUSE"
      + query_acceleration_max_scale_factor = 8
      + resource_monitor                    = (known after apply)
      + scaling_policy                      = (known after apply)
      + statement_queued_timeout_in_seconds = 0
      + statement_timeout_in_seconds        = 172800
      + warehouse_size                      = "LARGE"
      + warehouse_type                      = "STANDARD"
    }

  # module.snowflake_resources.snowflake_warehouse_grant.warehouse_grant will be created
  + resource "snowflake_warehouse_grant" "warehouse_grant" {
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + privilege              = "USAGE"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + warehouse_name         = "DEMO_TASK_WAREHOUSE"
      + with_grant_option      = false
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.snowflake_resources.snowflake_schema_grant.schema_ro_grant,
  on ../modules/snowflake_resources/grants.tf line 19, in resource "snowflake_schema_grant" "schema_ro_grant":
  19: resource "snowflake_schema_grant" "schema_ro_grant" {

This resource is deprecated and will be removed in a future major version
release. Please use snowflake_grant_privileges_to_role instead.

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @nisar198, Action: `pull_request`*